# Assignment 24

# Q1

Here are five functions of the pandas library along with their execution


read_csv(): This function is used to read data from a CSV file and create a DataFrame object.

fillna(): This function is used to replace missing values in a DataFrame with a specified value or method. 

groupby(): This function is used to group data in a DataFrame based on one or more columns. 

merge(): This function is used to join two or more DataFrames based on a common column. 

pivot_table(): This function is used to create a pivot table from a DataFrame

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [ ]:
df.fillna(0)

In [7]:
# Example for groupby
import pandas as pd

# create a DataFrame
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily', 'Alice'],
    'age': [25, 30, 35, 40, 45, 50],
    'gender': ['F', 'M', 'M', 'M', 'F', 'F']
}
df = pd.DataFrame(data)

# group the data by gender and calculate the mean age
grouped_data = df.groupby('gender')['age'].mean()

# print the result
print(grouped_data)

gender
F    40.0
M    35.0
Name: age, dtype: float64

In [8]:
# Example for Merge

# create two DataFrames
df1 = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie'], 'age': [25, 30, 35]})
df2 = pd.DataFrame({'name': ['Bob', 'David', 'Emily'], 'gender': ['M', 'M', 'F']})

# merge the DataFrames based on the name column
merged_df = pd.merge(df1, df2, on='name')

# print the result
print(merged_df)

  name  age gender
0  Bob   30      M

In [9]:
merged_df

  name  age gender
0  Bob   30      M

# Q2

In [32]:
sata={"A":[565,343,7878,1234],
      "B":["Ay","AN", "Mna", "kisd"],
      "C": [1212121,"ddfd","qqwqwqqq","aaas"]}
fk= pd.DataFrame(sata)
fk

      A     B         C
0   565    Ay   1212121
1   343    AN      ddfd
2  7878   Mna  qqwqwqqq
3  1234  kisd      aaas

In [6]:
# To reindex

In [33]:
fk['New_col'] = pp
pp=[ i for i in range(1,9,2) ]
fk.set_index("New_col")

            A     B         C
New_col
1         565    Ay   1212121
3         343    AN      ddfd
5        7878   Mna  qqwqwqqq
7        1234  kisd      aaas

# Q3

In [19]:
data1= {"Values" :[11,20,34,47,51,69]}
df=pd.DataFrame(data1)

df['Values'][0:3].sum()

65

In [20]:
df

   Values
0      11
1      20
2      34
3      47
4      51
5      69

In [11]:
p=0
for i in df['Values'][0:3]:
    p=p+i
print(p)

65

# Q4

In [6]:
tet={"Text" : [" My Name is Ayan Tiwary", " Yay ayay bdjsh fgfgf hjdh jdfhdfh"]}
fd= pd.DataFrame(tet)
fd['word_count'] = fd['Text'].apply(lambda x : len(x.split()))

In [7]:
fd

                                 Text  word_count
0              My Name is Ayan Tiwary           5
1   Yay ayay bdjsh fgfgf hjdh jdfhdfh           6

# Q5

DataFrame.size and DataFrame.shape are both methods of Pandas DataFrame, but they return different information about the DataFrame.

DataFrame.size returns the total number of elements in the DataFrame, which is the product of the number of rows and the number of columns.

DataFrame.shape returns a tuple representing the dimensions of the DataFrame, i.e., the number of rows and columns in the DataFrame. The tuple contains two integers, the first integer is the number of rows, and the second integer is the number of columns.

# Q6

df= pd.read_excel   
.

This function is used in  pandas to read an excel file.

# Q7

In [9]:
def extract(x):
    p=""
    for i in x:
        if i!= "@":
            p=p+i
        else:
            break
    return p

In [10]:
email = {"EMAIL": ["ayanti@gmail.com","pwskills@gmail.com","gogogo@gmail.com"]}
sd= pd.DataFrame(email)
sd["UserName"] = sd["EMAIL"].apply(extract)

In [11]:
sd

                EMAIL  UserName
0    ayanti@gmail.com    ayanti
1  pwskills@gmail.com  pwskills
2    gogogo@gmail.com    gogogo

# Q8

In [12]:
koka = {"A" : [1,2,3,4,5,6,7,8,9,10],
        "B" : [11,12,34,2,3,5,6,14,6,9],
        "C" : [1,2,3,4,54,32,1,2,4,1]}
sa= pd.DataFrame(koka)

In [16]:
qw = sa[(sa["A"]>5) & (sa["B"]<10)]

In [17]:
qw

    A  B   C
5   6  5  32
6   7  6   1
8   9  6   4
9  10  9   1

# Q9

In [22]:
data2= {"Values" :[11,20,34,47,51,69]}
wq= pd.DataFrame(data2)
wq["Values"].describe()

count     6.000000
mean     38.666667
std      21.341665
min      11.000000
25%      23.500000
50%      40.500000
75%      50.000000
max      69.000000
Name: Values, dtype: float64

# Q10

In [12]:
kata = {"Sales" :[ 100,221,311,4412,50,206,741,8522,902,1052,25,3478,402,525,605,702,845,9551],
        "Date" : pd.date_range(start = '2022-03-10' ,end = '2022-03-27')}
aq =  pd.DataFrame(kata)
aq['MovingAverage'] =  aq['Sales'].rolling(window = 7 ).mean()
aq.fillna("Avaliable from 7 th day")

    Sales       Date            MovingAverage
0     100 2022-03-10  Avaliable from 7 th day
1     221 2022-03-11  Avaliable from 7 th day
2     311 2022-03-12  Avaliable from 7 th day
3    4412 2022-03-13  Avaliable from 7 th day
4      50 2022-03-14  Avaliable from 7 th day
5     206 2022-03-15  Avaliable from 7 th day
6     741 2022-03-16                    863.0
7    8522 2022-03-17              2066.142857
8     902 2022-03-18              2163.428571
9    1052 2022-03-19              2269.285714
10     25 2022-03-20              1642.571429
11   3478 2022-03-21              2132.285714
12    402 2022-03-22              2160.285714
13    525 2022-03-23              2129.428571
14    605 2022-03-24               998.428571
15    702 2022-03-25               969.857143
16    845 2022-03-26               940.285714
17   9551 2022-03-27              2301.142857

# Q11

In [18]:
wata = {"Date" : pd.date_range(start = '2022-03-10' ,end = '2022-03-27')}
zx =  pd.DataFrame(wata)
zx['Weekday'] = zx["Date"].dt.day_name()
zx

         Date    Weekday
0  2022-03-10   Thursday
1  2022-03-11     Friday
2  2022-03-12   Saturday
3  2022-03-13     Sunday
4  2022-03-14     Monday
5  2022-03-15    Tuesday
6  2022-03-16  Wednesday
7  2022-03-17   Thursday
8  2022-03-18     Friday
9  2022-03-19   Saturday
10 2022-03-20     Sunday
11 2022-03-21     Monday
12 2022-03-22    Tuesday
13 2022-03-23  Wednesday
14 2022-03-24   Thursday
15 2022-03-25     Friday
16 2022-03-26   Saturday
17 2022-03-27     Sunday

# Q12

In [29]:
fta = {"Date" : pd.date_range(start = '2022-12-12' ,end = '2023-02-27')}
cx = pd.DataFrame(fta)
jh = cx[(cx["Date"] > '2023-01-01') & (cx["Date"]<'2023-01-31')]
jh

         Date
21 2023-01-02
22 2023-01-03
23 2023-01-04
24 2023-01-05
25 2023-01-06
26 2023-01-07
27 2023-01-08
28 2023-01-09
29 2023-01-10
30 2023-01-11
31 2023-01-12
32 2023-01-13
33 2023-01-14
34 2023-01-15
35 2023-01-16
36 2023-01-17
37 2023-01-18
38 2023-01-19
39 2023-01-20
40 2023-01-21
41 2023-01-22
42 2023-01-23
43 2023-01-24
44 2023-01-25
45 2023-01-26
46 2023-01-27
47 2023-01-28
48 2023-01-29
49 2023-01-30

# Q13

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is pandas itself. In fact, the standard convention to import pandas is

import pandas as pd